'''
# 1.朴素贝叶斯----书籍评价预测
import pandas as pd
import numpy as np
data=pd.read_csv("./书籍评价.csv",encoding='gbk')
data['labels']=np.where(data['评价']=='好评',1,0)
# 加了一列label 1表示好评 0表示差评
# np.where(条件, A, B)是 NumPy 的一个函数，表示：
# 如果条件为真 → 取值 A
# 如果条件为假 → 取值 B
# print(data)
y=data['labels']
stop_words=[]
# 停用词（Stop Words）是指：
# 在文本处理中没有实际意义、可以过滤掉的常用词。
# 比如：的、了、和、是、我、你、他、有、就、在、吧、啊...
# 这些词虽然常见，但对情感分析、分类等任务帮助不大。
# 所以我们通常从文本中删除它们。
with open('stopwords.txt',encoding='utf-8') as file:
    lines=file.readlines() # readlines将多行数据存入一个列表 保留行尾\n
    # print(lines) # ['!\n', '"\n', '#\n', '$\n', '%\n', '&\n', "'\n", '(\n', ')\n', '*\n', '+\n', ',\n', '-\n', '--\n', '.\n', '..\n', '...\n', '......\n', '...................\n', './\n', '.一\n', '.数\n', '.日\n', '■\n', '▲\n', '\u3000\n', '、\n', '。\n', '〈\n', '〉\n', '《\n', '》\n', '》），\n', '」\n', '『\n', '』\n', '【\n', '】\n', '〔\n', '〕\n', '〕〔\n', '㈧\n', '一\n', '一.\n', '一一\n', '一下\n', '一个\n', '一些\n', '一何\n', '一切\n', '一则\n', '一则通过\n', '一天\n', '一定\n', '一方面\n', '一旦\n', '一时\n', '一来\n', '一样\n', '一次\n', '一片\n', '一番\n', '一直\n', '一致\n', '一般\n', '一起\n', '一转眼\n', '一边\n', '一面\n', '七\n', '万一\n', '三\n', '三天两头\n', '三番两次\n', '三番五次\n', '上\n', '上下\n', '上升\n', '上去\n', '上来\n', '上述\n', '上面\n', '下\n', '下列\n', '下去\n', '下来\n', '下面\n', '不\n', '不一\n', '不下\n', '不久\n', '不了\n', '不亦乐乎\n', '不仅\n', '不仅...而且\n', '不仅仅\n', '不仅仅是\n', '不会\n', '不但\n', '不但...而且\n', '不光\n', '不免\n', '不再\n', '不力\n', '不单\n', '不变\n', '不只\n', '不可\n', '不可开交\n', '不可抗拒\n', '不同\n', '不外\n', '不外乎\n', '不够\n', '不大\n', '不如\n', '不妨\n', '不定\n', '不对\n', '不少\n', '不尽\n', '不尽然\n', '不巧\n', '不已\n', '不常\n', '不得\n', '不得不\n', '不得了\n', '不得已\n', '不必\n', '不怎么\n', '不怕\n', '不惟\n', '不成\n', '不拘\n', '不择手段\n', '不敢\n', '不料\n', '不断\n', '不日\n', '不时\n', '不是\n', '不曾\n', '不止\n', '不止一次\n', '不比\n', '不消\n', '不满\n', '不然\n', '不然的话\n', '不特\n', '不独\n', '不由得\n', '不知不觉\n', '不管\n', '不管怎样\n', '不经意\n', '不胜\n', '不能\n', '不能不\n', '不至于\n', '不若\n', '不要\n', '不论\n', '不起\n', '不足\n', '不过\n', '不迭\n', '不问\n', '不限\n', '与\n', '与其\n', '与其说\n', '与否\n', '与此同时\n', '专门\n', '且\n', '且不说\n', '且说\n', '两者\n', '严格\n', '严重\n', '个\n', '个人\n', '个别\n', '中小\n', '中间\n', '丰富\n', '串行\n', '临\n', '临到\n', '为\n', '为主\n', '为了\n', '为什么\n', '为什麽\n', '为何\n', '为止\n', '为此\n', '为着\n', '主张\n', '主要\n', '举凡\n', '举行\n', '乃\n', '乃至\n', '乃至于\n', '么\n', '之\n', '之一\n', '之前\n', '之后\n', '之後\n', '之所以\n', '之类\n', '乌乎\n', '乎\n', '乒\n', '乘\n', '乘势\n', '乘机\n', '乘胜\n', '乘虚\n', '乘隙\n', '九\n', '也\n', '也好\n', '也就是说\n', '也是\n', '也罢\n', '了\n', '了解\n', '争取\n', '二\n', '二来\n', '二话不说\n', '二话没说\n', '于\n', '于是\n', '于是乎\n', '云云\n', '云尔\n', '互\n', '互相\n', '五\n', '些\n', '交口\n', '亦\n', '产生\n', '亲口\n', '亲手\n', '亲眼\n', '亲自\n', '亲身\n', '人\n', '人人\n', '人们\n', '人家\n', '人民\n', '什么\n', '什么样\n', '什麽\n', '仅\n', '仅仅\n', '今\n', '今后\n', '今天\n', '今年\n', '今後\n', '介于\n', '仍\n', '仍旧\n', '仍然\n', '从\n', '从不\n', '从严\n', '从中\n', '从事\n', '从今以后\n', '从优\n', '从古到今\n', '从古至今\n', '从头\n', '从宽\n', '从小\n', '从新\n', '从无到有\n', '从早到晚\n', '从未\n', '从来\n', '从此\n', '从此以后\n', '从而\n', '从轻\n', '从速\n', '从重\n', '他\n', '他人\n', '他们\n', '他是\n', '他的\n', '代替\n', '以\n', '以上\n', '以下\n', '以为\n', '以便\n', '以免\n', '以前\n', '以及\n', '以后\n', '以外\n', '以後\n', '以故\n', '以期\n', '以来\n', '以至\n', '以至于\n', '以致\n', '们\n', '任\n', '任何\n', '任凭\n', '任务\n', '企图\n', '伙同\n', '会\n', '伟大\n', '传\n', '传说\n', '传闻\n', '似乎\n', '似的\n', '但\n', '但凡\n', '但愿\n', '但是\n', '何\n', '何乐而不为\n', '何以\n', '何况\n', '何处\n', '何妨\n', '何尝\n', '何必\n', '何时\n', '何止\n', '何苦\n', '何须\n', '余外\n', '作为\n', '你\n', '你们\n', '你是\n', '你的\n', '使\n', '使得\n', '使用\n', '例如\n', '依\n', '依据\n', '依照\n', '依靠\n', '便\n', '便于\n', '促进\n', '保持\n', '保管\n', '保险\n', '俺\n', '俺们\n', '倍加\n', '倍感\n', '倒不如\n', '倒不如说\n', '倒是\n', '倘\n', '倘使\n', '倘或\n', '倘然\n', '倘若\n', '借\n', '借以\n', '借此\n', '假使\n', '假如\n', '假若\n', '偏偏\n', '做到\n', '偶尔\n', '偶而\n', '傥然\n', '像\n', '儿\n', '允许\n', '元／吨\n', '充其极\n', '充其量\n', '充分\n', '先不先\n', '先后\n', '先後\n', '先生\n', '光\n', '光是\n', '全体\n', '全力\n', '全年\n', '全然\n', '全身心\n', '全部\n', '全都\n', '全面\n', '八\n', '八成\n', '公然\n', '六\n', '兮\n', '共\n', '共同\n', '共总\n', '关于\n', '其\n', '其一\n', '其中\n', '其二\n', '其他\n', '其余\n', '其后\n', '其它\n', '其实\n', '其次\n', '具体\n', '具体地说\n', '具体来说\n', '具体说来\n', '具有\n', '兼之\n', '内\n', '再\n', '再其次\n', '再则\n', '再有\n', '再次\n', '再者\n', '再者说\n', '再说\n', '冒\n', '冲\n', '决不\n', '决定\n', '决非\n', '况且\n', '准备\n', '凑巧\n', '凝神\n', '几\n', '几乎\n', '几度\n', '几时\n', '几番\n', '几经\n', '凡\n', '凡是\n', '凭\n', '凭借\n', '出\n', '出于\n', '出去\n', '出来\n', '出现\n', '分别\n', '分头\n', '分期\n', '分期分批\n', '切\n', '切不可\n', '切切\n', '切勿\n', '切莫\n', '则\n', '则甚\n', '刚\n', '刚好\n', '刚巧\n', '刚才\n', '初\n', '别\n', '别人\n', '别处\n', '别是\n', '别的\n', '别管\n', '别说\n', '到\n', '到了儿\n', '到处\n', '到头\n', '到头来\n', '到底\n', '到目前为止\n', '前后\n', '前此\n', '前者\n', '前进\n', '前面\n', '加上\n', '加之\n', '加以\n', '加入\n', '加强\n', '动不动\n', '动辄\n', '勃然\n', '匆匆\n', '十分\n', '千\n', '千万\n', '千万千万\n', '半\n', '单\n', '单单\n', '单纯\n', '即\n', '即令\n', '即使\n', '即便\n', '即刻\n', '即如\n', '即将\n', '即或\n', '即是说\n', '即若\n', '却\n', '却不\n', '历\n', '原来\n', '去\n', '又\n', '又及\n', '及\n', '及其\n', '及时\n', '及至\n', '双方\n', '反之\n', '反之亦然\n', '反之则\n', '反倒\n', '反倒是\n', '反应\n', '反手\n', '反映\n', '反而\n', '反过来\n', '反过来说\n', '取得\n', '取道\n', '受到\n', '变成\n', '古来\n', '另\n', '另一个\n', '另一方面\n', '另外\n', '另悉\n', '另方面\n', '另行\n', '只\n', '只当\n', '只怕\n', '只是\n', '只有\n', '只消\n', '只要\n', '只限\n', '叫\n', '叫做\n', '召开\n', '叮咚\n', '叮当\n', '可\n', '可以\n', '可好\n', '可是\n', '可能\n', '可见\n', '各\n', '各个\n', '各人\n', '各位\n', '各地\n', '各式\n', '各种\n', '各级\n', '各自\n', '合理\n', '同\n', '同一\n', '同时\n', '同样\n', '后\n', '后来\n', '后者\n', '后面\n', '向\n', '向使\n', '向着\n', '吓\n', '吗\n', '否则\n', '吧\n', '吧哒\n', '吱\n', '呀\n', '呃\n', '呆呆地\n', '呐\n', '呕\n', '呗\n', '呜\n', '呜呼\n', '呢\n', '周围\n', '呵\n', '呵呵\n', '呸\n', '呼哧\n', '呼啦\n', '咋\n', '和\n', '咚\n', '咦\n', '咧\n', '咱\n', '咱们\n', '咳\n', '哇\n', '哈\n', '哈哈\n', '哉\n', '哎\n', '哎呀\n', '哎哟\n', '哗\n', '哗啦\n', '哟\n', '哦\n', '哩\n', '哪\n', '哪个\n', '哪些\n', '哪儿\n', '哪天\n', '哪年\n', '哪怕\n', '哪样\n', '哪边\n', '哪里\n', '哼\n', '哼唷\n', '唉\n', '唯有\n', '啊\n', '啊呀\n', '啊哈\n', '啊哟\n', '啐\n', '啥\n', '啦\n', '啪达\n', '啷当\n', '喀\n', '喂\n', '喏\n', '喔唷\n', '喽\n', '嗡\n', '嗡嗡\n', '嗬\n', '嗯\n', '嗳\n', '嘎\n', '嘎嘎\n', '嘎登\n', '嘘\n', '嘛\n', '嘻\n', '嘿\n', '嘿嘿\n', '四\n', '因\n', '因为\n', '因了\n', '因此\n', '因着\n', '因而\n', '固\n', '固然\n', '在\n', '在下\n', '在于\n', '地\n', '均\n', '坚决\n', '坚持\n', '基于\n', '基本\n', '基本上\n', '处在\n', '处处\n', '处理\n', '复杂\n', '多\n', '多么\n', '多亏\n', '多多\n', '多多少少\n', '多多益善\n', '多少\n', '多年前\n', '多年来\n', '多数\n', '多次\n', '够瞧的\n', '大\n', '大不了\n', '大举\n', '大事\n', '大体\n', '大体上\n', '大凡\n', '大力\n', '大多\n', '大多数\n', '大大\n', '大家\n', '大张旗鼓\n', '大批\n', '大抵\n', '大概\n', '大略\n', '大约\n', '大致\n', '大都\n', '大量\n', '大面儿上\n', '失去\n', '奇\n', '奈\n', '奋勇\n', '她\n', '她们\n', '她是\n', '她的\n', '好\n', '好在\n', '好的\n', '好象\n', '如\n', '如上\n', '如上所述\n', '如下\n', '如今\n', '如何\n', '如其\n', '如前所述\n', '如同\n', '如常\n', '如是\n', '如期\n', '如果\n', '如次\n', '如此\n', '如此等等\n', '如若\n', '始而\n', '姑且\n', '存在\n', '存心\n', '孰料\n', '孰知\n', '宁\n', '宁可\n', '宁愿\n', '宁肯\n', '它\n', '它们\n', '它们的\n', '它是\n', '它的\n', '安全\n', '完全\n', '完成\n', '定\n', '实现\n', '实际\n', '宣布\n', '容易\n', '密切\n', '对\n', '对于\n', '对应\n', '对待\n', '对方\n', '对比\n', '将\n', '将才\n', '将要\n', '将近\n', '小\n', '少数\n', '尔\n', '尔后\n', '尔尔\n', '尔等\n', '尚且\n', '尤其\n', '就\n', '就地\n', '就是\n', '就是了\n', '就是说\n', '就此\n', '就算\n', '就要\n', '尽\n', '尽可能\n', '尽如人意\n', '尽心尽力\n', '尽心竭力\n', '尽快\n', '尽早\n', '尽然\n', '尽管\n', '尽管如此\n', '尽量\n', '局外\n', '居然\n', '届时\n', '属于\n', '屡\n', '屡屡\n', '屡次\n', '屡次三番\n', '岂\n', '岂但\n', '岂止\n', '岂非\n', '川流不息\n', '左右\n', '巨大\n', '巩固\n', '差一点\n', '差不多\n', '己\n', '已\n', '已矣\n', '已经\n', '巴\n', '巴巴\n', '带\n', '帮助\n', '常\n', '常常\n', '常言说\n', '常言说得好\n', '常言道\n', '平素\n', '年复一年\n', '并\n', '并不\n', '并不是\n', '并且\n', '并排\n', '并无\n', '并没\n', '并没有\n', '并肩\n', '并非\n', '广大\n', '广泛\n', '应当\n', '应用\n', '应该\n', '庶乎\n', '庶几\n', '开外\n', '开始\n', '开展\n', '引起\n', '弗\n', '弹指之间\n', '强烈\n', '强调\n', '归\n', '归根到底\n', '归根结底\n', '归齐\n', '当\n', '当下\n', '当中\n', '当儿\n', '当前\n', '当即\n', '当口儿\n', '当地\n', '当场\n', '当头\n', '当庭\n', '当时\n', '当然\n', '当真\n', '当着\n', '形成\n', '彻夜\n', '彻底\n', '彼\n', '彼时\n', '彼此\n', '往\n', '往往\n', '待\n', '待到\n', '很\n', '很多\n', '很少\n', '後来\n', '後面\n', '得\n', '得了\n', '得出\n', '得到\n', '得天独厚\n', '得起\n', '心里\n', '必\n', '必定\n', '必将\n', '必然\n', '必要\n', '必须\n', '快\n', '快要\n', '忽地\n', '忽然\n', '怎\n', '怎么\n', '怎么办\n', '怎么样\n', '怎奈\n', '怎样\n', '怎麽\n', '怕\n', '急匆匆\n', '怪\n', '怪不得\n', '总之\n', '总是\n', '总的来看\n', '总的来说\n', '总的说来\n', '总结\n', '总而言之\n', '恍然\n', '恐怕\n', '恰似\n', '恰好\n', '恰如\n', '恰巧\n', '恰恰\n', '恰恰相反\n', '恰逢\n', '您\n', '您们\n', '您是\n', '惟其\n', '惯常\n', '意思\n', '愤然\n', '愿意\n', '慢说\n', '成为\n', '成年\n', '成年累月\n', '成心\n', '我\n', '我们\n', '我是\n', '我的\n', '或\n', '或则\n', '或多或少\n', '或是\n', '或曰\n', '或者\n', '或许\n', '战斗\n', '截然\n', '截至\n', '所\n', '所以\n', '所在\n', '所幸\n', '所有\n', '所谓\n', '才\n', '才能\n', '扑通\n', '打\n', '打从\n', '打开天窗说亮话\n', '扩大\n', '把\n', '抑或\n', '抽冷子\n', '拦腰\n', '拿\n', '按\n', '按时\n', '按期\n', '按照\n', '按理\n', '按说\n', '挨个\n', '挨家挨户\n', '挨次\n', '挨着\n', '挨门挨户\n', '挨门逐户\n', '换句话说\n', '换言之\n', '据\n', '据实\n', '据悉\n', '据我所知\n', '据此\n', '据称\n', '据说\n', '掌握\n', '接下来\n', '接着\n', '接著\n', '接连不断\n', '放量\n', '故\n', '故意\n', '故此\n', '故而\n', '敞开儿\n', '敢\n', '敢于\n', '敢情\n', '数/\n', '整个\n', '断然\n', '方\n', '方便\n', '方才\n', '方能\n', '方面\n', '旁人\n', '无\n', '无宁\n', '无法\n', '无论\n', '既\n', '既...又\n', '既往\n', '既是\n', '既然\n', '日复一日\n', '日渐\n', '日益\n', '日臻\n', '日见\n', '时候\n', '昂然\n', '明显\n', '明确\n', '是\n', '是不是\n', '是以\n', '是否\n', '是的\n', '显然\n', '显著\n', '普通\n', '普遍\n', '暗中\n', '暗地里\n', '暗自\n', '更\n', '更为\n', '更加\n', '更进一步\n', '曾\n', '曾经\n', '替\n', '替代\n', '最\n', '最后\n', '最大\n', '最好\n', '最後\n', '最近\n', '最高\n', '有\n', '有些\n', '有关\n', '有利\n', '有力\n', '有及\n', '有所\n', '有效\n', '有时\n', '有点\n', '有的\n', '有的是\n', '有着\n', '有著\n', '望\n', '朝\n', '朝着\n', '末##末\n', '本\n', '本人\n', '本地\n', '本着\n', '本身\n', '权时\n', '来\n', '来不及\n', '来得及\n', '来看\n', '来着\n', '来自\n', '来讲\n', '来说\n', '极\n', '极为\n', '极了\n', '极其\n', '极力\n', '极大\n', '极度\n', '极端\n', '构成\n', '果然\n', '果真\n', '某\n', '某个\n', '某些\n', '某某\n', '根据\n', '根本\n', '格外\n', '梆\n', '概\n', '次第\n', '欢迎\n', '欤\n', '正值\n', '正在\n', '正如\n', '正巧\n', '正常\n', '正是\n', '此\n', '此中\n', '此后\n', '此地\n', '此处\n', '此外\n', '此时\n', '此次\n', '此间\n', '殆\n', '毋宁\n', '每\n', '每个\n', '每天\n', '每年\n', '每当\n', '每时每刻\n', '每每\n', '每逢\n', '比\n', '比及\n', '比如\n', '比如说\n', '比方\n', '比照\n', '比起\n', '比较\n', '毕竟\n', '毫不\n', '毫无\n', '毫无例外\n', '毫无保留地\n', '汝\n', '沙沙\n', '没\n', '没奈何\n', '没有\n', '沿\n', '沿着\n', '注意\n', '活\n', '深入\n', '清楚\n', '满\n', '满足\n', '漫说\n', '焉\n', '然\n', '然则\n', '然后\n', '然後\n', '然而\n', '照\n', '照着\n', '牢牢\n', '特别是\n', '特殊\n', '特点\n', '犹且\n', '犹自\n', '独\n', '独自\n', '猛然\n', '猛然间\n', '率尔\n', '率然\n', '现代\n', '现在\n', '理应\n', '理当\n', '理该\n', '瑟瑟\n', '甚且\n', '甚么\n', '甚或\n', '甚而\n', '甚至\n', '甚至于\n', '用\n', '用来\n', '甫\n', '甭\n', '由\n', '由于\n', '由是\n', '由此\n', '由此可见\n', '略\n', '略为\n', '略加\n', '略微\n', '白\n', '白白\n', '的\n', '的确\n', '的话\n', '皆可\n', '目前\n', '直到\n', '直接\n', '相似\n', '相信\n', '相反\n', '相同\n', '相对\n', '相对而言\n', '相应\n', '相当\n', '相等\n', '省得\n', '看\n', '看上去\n', '看出\n', '看到\n', '看来\n', '看样子\n', '看看\n', '看见\n', '看起来\n', '真是\n', '真正\n', '眨眼\n', '着\n', '着呢\n', '矣\n', '矣乎\n', '矣哉\n', '知道\n', '砰\n', '确定\n', '碰巧\n', '社会主义\n', '离\n', '种\n', '积极\n', '移动\n', '究竟\n', '穷年累月\n', '突出\n', '突然\n', '窃\n', '立\n', '立刻\n', '立即\n', '立地\n', '立时\n', '立马\n', '竟\n', '竟然\n', '竟而\n', '第\n', '第二\n', '等\n', '等到\n', '等等\n', '策略地\n', '简直\n', '简而言之\n', '简言之\n', '管\n', '类如\n', '粗\n', '精光\n', '紧接着\n', '累年\n', '累次\n', '纯\n', '纯粹\n', '纵\n', '纵令\n', '纵使\n', '纵然\n', '练习\n', '组成\n', '经\n', '经常\n', '经过\n', '结合\n', '结果\n', '给\n', '绝\n', '绝不\n', '绝对\n', '绝非\n', '绝顶\n', '继之\n', '继后\n', '继续\n', '继而\n', '维持\n', '综上所述\n', '缕缕\n', '罢了\n', '老\n', '老大\n', '老是\n', '老老实实\n', '考虑\n', '者\n', '而\n', '而且\n', '而况\n', '而又\n', '而后\n', '而外\n', '而已\n', '而是\n', '而言\n', '而论\n', '联系\n', '联袂\n', '背地里\n', '背靠背\n', '能\n', '能否\n', '能够\n', '腾\n', '自\n', '自个儿\n', '自从\n', '自各儿\n', '自后\n', '自家\n', '自己\n', '自打\n', '自身\n', '臭\n', '至\n', '至于\n', '至今\n', '至若\n', '致\n', '般的\n', '良好\n', '若\n', '若夫\n', '若是\n', '若果\n', '若非\n', '范围\n', '莫\n', '莫不\n', '莫不然\n', '莫如\n', '莫若\n', '莫非\n', '获得\n', '藉以\n', '虽\n', '虽则\n', '虽然\n', '虽说\n', '蛮\n', '行为\n', '行动\n', '表明\n', '表示\n', '被\n', '要\n', '要不\n', '要不是\n', '要不然\n', '要么\n', '要是\n', '要求\n', '见\n', '规定\n', '觉得\n', '譬喻\n', '譬如\n', '认为\n', '认真\n', '认识\n', '让\n', '许多\n', '论\n', '论说\n', '设使\n', '设或\n', '设若\n', '诚如\n', '诚然\n', '话说\n', '该\n', '该当\n', '说明\n', '说来\n', '说说\n', '请勿\n', '诸\n', '诸位\n', '诸如\n', '谁\n', '谁人\n', '谁料\n', '谁知\n', '谨\n', '豁然\n', '贼死\n', '赖以\n', '赶\n', '赶快\n', '赶早不赶晚\n', '起\n', '起先\n', '起初\n', '起头\n', '起来\n', '起见\n', '起首\n', '趁\n', '趁便\n', '趁势\n', '趁早\n', '趁机\n', '趁热\n', '趁着\n', '越是\n', '距\n', '跟\n', '路经\n', '转动\n', '转变\n', '转贴\n', '轰然\n', '较\n', '较为\n', '较之\n', '较比\n', '边\n', '达到\n', '达旦\n', '迄\n', '迅速\n', '过\n', '过于\n', '过去\n', '过来\n', '运用\n', '近\n', '近几年来\n', '近年来\n', '近来\n', '还\n', '还是\n', '还有\n', '还要\n', '这\n', '这一来\n', '这个\n', '这么\n', '这么些\n', '这么样\n', '这么点儿\n', '这些\n', '这会儿\n', '这儿\n', '这就是说\n', '这时\n', '这样\n', '这次\n', '这点\n', '这种\n', '这般\n', '这边\n', '这里\n', '这麽\n', '进入\n', '进去\n', '进来\n', '进步\n', '进而\n', '进行\n', '连\n', '连同\n', '连声\n', '连日\n', '连日来\n', '连袂\n', '连连\n', '迟早\n', '迫于\n', '适应\n', '适当\n', '适用\n', '逐步\n', '逐渐\n', '通常\n', '通过\n', '造成\n', '逢\n', '遇到\n', '遭到\n', '遵循\n', '遵照\n', '避免\n', '那\n', '那个\n', '那么\n', '那么些\n', '那么样\n', '那些\n', '那会儿\n', '那儿\n', '那时\n', '那末\n', '那样\n', '那般\n', '那边\n', '那里\n', '那麽\n', '部分\n', '都\n', '鄙人\n', '采取\n', '里面\n', '重大\n', '重新\n', '重要\n', '鉴于\n', '针对\n', '长期以来\n', '长此下去\n', '长线\n', '长话短说\n', '问题\n', '间或\n', '防止\n', '阿\n', '附近\n', '陈年\n', '限制\n', '陡然\n', '除\n', '除了\n', '除却\n', '除去\n', '除外\n', '除开\n', '除此\n', '除此之外\n', '除此以外\n', '除此而外\n', '除非\n', '随\n', '随后\n', '随时\n', '随着\n', '随著\n', '隔夜\n', '隔日\n', '难得\n', '难怪\n', '难说\n', '难道\n', '难道说\n', '集中\n', '零\n', '需要\n', '非但\n', '非常\n', '非徒\n', '非得\n', '非特\n', '非独\n', '靠\n', '顶多\n', '顷\n', '顷刻\n', '顷刻之间\n', '顷刻间\n', '顺\n', '顺着\n', '顿时\n', '颇\n', '风雨无阻\n', '饱\n', '首先\n', '马上\n', '高低\n', '高兴\n', '默然\n', '默默地\n', '齐\n', '︿\n', '！\n', '＃\n', '＄\n', '％\n', '＆\n', '＇\n', '（\n', '）\n', '）÷（１－\n', '）、\n', '＊\n', '＋\n', '＋ξ\n', '＋＋\n', '，\n', '，也\n', '－\n', '－β\n', '－－\n', '－［＊］－\n', '．\n', '／\n', '：\n', '；\n', '＜\n', '＜±\n', '＜Δ\n', '＜λ\n', '＜φ\n', '＜＜\n', '＝\n', '＝″\n', '＝☆\n', '＝（\n', '＝－\n', '＝［\n', '＝｛\n', '＞\n', '＞λ\n', '］\n', '］∧′＝［\n', '］［\n', '＿\n', 'ａ］\n', 'ｂ］\n', 'ｃ］\n', 'ｅ］\n', 'ｆ］\n', 'ｎｇ昉\n', '｛\n', '｛－\n', '｜\n', '｝\n', '｝＞\n', '～\n', '～±\n', '～＋\n', '￥']
    # print(type(lines)) # <class 'list'>
    stop_words=[line.strip() for line in lines] # 主要就是去掉 \n
    # strip功能
    # >>> " ,ok a,y] ".strip()
    # ',ok a,y]'
    # print(stop_words) #['!', '"', '#', '$', '%', '&', "'", '(', ')', '*', '+', ',', '-', '--', '.', '..', '...', '......', '...................', './', '.一', '.数', '.日', '■', '▲', '', '、', '。', '〈', '〉', '《', '》', '》），', '」', '『', '』', '【', '】', '〔', '〕', '〕〔', '㈧', '一', '一.', '一一', '一下', '一个', '一些', '一何', '一切', '一则', '一则通过', '一天', '一定', '一方面', '一旦', '一时', '一来', '一样', '一次', '一片', '一番', '一直', '一致', '一般', '一起', '一转眼', '一边', '一面', '七', '万一', '三', '三天两头', '三番两次', '三番五次', '上', '上下', '上升', '上去', '上来', '上述', '上面', '下', '下列', '下去', '下来', '下面', '不', '不一', '不下', '不久', '不了', '不亦乐乎', '不仅', '不仅...而且', '不仅仅', '不仅仅是', '不会', '不但', '不但...而且', '不光', '不免', '不再', '不力', '不单', '不变', '不只', '不可', '不可开交', '不可抗拒', '不同', '不外', '不外乎', '不够', '不大', '不如', '不妨', '不定', '不对', '不少', '不尽', '不尽然', '不巧', '不已', '不常', '不得', '不得不', '不得了', '不得已', '不必', '不怎么', '不怕', '不惟', '不成', '不拘', '不择手段', '不敢', '不料', '不断', '不日', '不时', '不是', '不曾', '不止', '不止一次', '不比', '不消', '不满', '不然', '不然的话', '不特', '不独', '不由得', '不知不觉', '不管', '不管怎样', '不经意', '不胜', '不能', '不能不', '不至于', '不若', '不要', '不论', '不起', '不足', '不过', '不迭', '不问', '不限', '与', '与其', '与其说', '与否', '与此同时', '专门', '且', '且不说', '且说', '两者', '严格', '严重', '个', '个人', '个别', '中小', '中间', '丰富', '串行', '临', '临到', '为', '为主', '为了', '为什么', '为什麽', '为何', '为止', '为此', '为着', '主张', '主要', '举凡', '举行', '乃', '乃至', '乃至于', '么', '之', '之一', '之前', '之后', '之後', '之所以', '之类', '乌乎', '乎', '乒', '乘', '乘势', '乘机', '乘胜', '乘虚', '乘隙', '九', '也', '也好', '也就是说', '也是', '也罢', '了', '了解', '争取', '二', '二来', '二话不说', '二话没说', '于', '于是', '于是乎', '云云', '云尔', '互', '互相', '五', '些', '交口', '亦', '产生', '亲口', '亲手', '亲眼', '亲自', '亲身', '人', '人人', '人们', '人家', '人民', '什么', '什么样', '什麽', '仅', '仅仅', '今', '今后', '今天', '今年', '今後', '介于', '仍', '仍旧', '仍然', '从', '从不', '从严', '从中', '从事', '从今以后', '从优', '从古到今', '从古至今', '从头', '从宽', '从小', '从新', '从无到有', '从早到晚', '从未', '从来', '从此', '从此以后', '从而', '从轻', '从速', '从重', '他', '他人', '他们', '他是', '他的', '代替', '以', '以上', '以下', '以为', '以便', '以免', '以前', '以及', '以后', '以外', '以後', '以故', '以期', '以来', '以至', '以至于', '以致', '们', '任', '任何', '任凭', '任务', '企图', '伙同', '会', '伟大', '传', '传说', '传闻', '似乎', '似的', '但', '但凡', '但愿', '但是', '何', '何乐而不为', '何以', '何况', '何处', '何妨', '何尝', '何必', '何时', '何止', '何苦', '何须', '余外', '作为', '你', '你们', '你是', '你的', '使', '使得', '使用', '例如', '依', '依据', '依照', '依靠', '便', '便于', '促进', '保持', '保管', '保险', '俺', '俺们', '倍加', '倍感', '倒不如', '倒不如说', '倒是', '倘', '倘使', '倘或', '倘然', '倘若', '借', '借以', '借此', '假使', '假如', '假若', '偏偏', '做到', '偶尔', '偶而', '傥然', '像', '儿', '允许', '元／吨', '充其极', '充其量', '充分', '先不先', '先后', '先後', '先生', '光', '光是', '全体', '全力', '全年', '全然', '全身心', '全部', '全都', '全面', '八', '八成', '公然', '六', '兮', '共', '共同', '共总', '关于', '其', '其一', '其中', '其二', '其他', '其余', '其后', '其它', '其实', '其次', '具体', '具体地说', '具体来说', '具体说来', '具有', '兼之', '内', '再', '再其次', '再则', '再有', '再次', '再者', '再者说', '再说', '冒', '冲', '决不', '决定', '决非', '况且', '准备', '凑巧', '凝神', '几', '几乎', '几度', '几时', '几番', '几经', '凡', '凡是', '凭', '凭借', '出', '出于', '出去', '出来', '出现', '分别', '分头', '分期', '分期分批', '切', '切不可', '切切', '切勿', '切莫', '则', '则甚', '刚', '刚好', '刚巧', '刚才', '初', '别', '别人', '别处', '别是', '别的', '别管', '别说', '到', '到了儿', '到处', '到头', '到头来', '到底', '到目前为止', '前后', '前此', '前者', '前进', '前面', '加上', '加之', '加以', '加入', '加强', '动不动', '动辄', '勃然', '匆匆', '十分', '千', '千万', '千万千万', '半', '单', '单单', '单纯', '即', '即令', '即使', '即便', '即刻', '即如', '即将', '即或', '即是说', '即若', '却', '却不', '历', '原来', '去', '又', '又及', '及', '及其', '及时', '及至', '双方', '反之', '反之亦然', '反之则', '反倒', '反倒是', '反应', '反手', '反映', '反而', '反过来', '反过来说', '取得', '取道', '受到', '变成', '古来', '另', '另一个', '另一方面', '另外', '另悉', '另方面', '另行', '只', '只当', '只怕', '只是', '只有', '只消', '只要', '只限', '叫', '叫做', '召开', '叮咚', '叮当', '可', '可以', '可好', '可是', '可能', '可见', '各', '各个', '各人', '各位', '各地', '各式', '各种', '各级', '各自', '合理', '同', '同一', '同时', '同样', '后', '后来', '后者', '后面', '向', '向使', '向着', '吓', '吗', '否则', '吧', '吧哒', '吱', '呀', '呃', '呆呆地', '呐', '呕', '呗', '呜', '呜呼', '呢', '周围', '呵', '呵呵', '呸', '呼哧', '呼啦', '咋', '和', '咚', '咦', '咧', '咱', '咱们', '咳', '哇', '哈', '哈哈', '哉', '哎', '哎呀', '哎哟', '哗', '哗啦', '哟', '哦', '哩', '哪', '哪个', '哪些', '哪儿', '哪天', '哪年', '哪怕', '哪样', '哪边', '哪里', '哼', '哼唷', '唉', '唯有', '啊', '啊呀', '啊哈', '啊哟', '啐', '啥', '啦', '啪达', '啷当', '喀', '喂', '喏', '喔唷', '喽', '嗡', '嗡嗡', '嗬', '嗯', '嗳', '嘎', '嘎嘎', '嘎登', '嘘', '嘛', '嘻', '嘿', '嘿嘿', '四', '因', '因为', '因了', '因此', '因着', '因而', '固', '固然', '在', '在下', '在于', '地', '均', '坚决', '坚持', '基于', '基本', '基本上', '处在', '处处', '处理', '复杂', '多', '多么', '多亏', '多多', '多多少少', '多多益善', '多少', '多年前', '多年来', '多数', '多次', '够瞧的', '大', '大不了', '大举', '大事', '大体', '大体上', '大凡', '大力', '大多', '大多数', '大大', '大家', '大张旗鼓', '大批', '大抵', '大概', '大略', '大约', '大致', '大都', '大量', '大面儿上', '失去', '奇', '奈', '奋勇', '她', '她们', '她是', '她的', '好', '好在', '好的', '好象', '如', '如上', '如上所述', '如下', '如今', '如何', '如其', '如前所述', '如同', '如常', '如是', '如期', '如果', '如次', '如此', '如此等等', '如若', '始而', '姑且', '存在', '存心', '孰料', '孰知', '宁', '宁可', '宁愿', '宁肯', '它', '它们', '它们的', '它是', '它的', '安全', '完全', '完成', '定', '实现', '实际', '宣布', '容易', '密切', '对', '对于', '对应', '对待', '对方', '对比', '将', '将才', '将要', '将近', '小', '少数', '尔', '尔后', '尔尔', '尔等', '尚且', '尤其', '就', '就地', '就是', '就是了', '就是说', '就此', '就算', '就要', '尽', '尽可能', '尽如人意', '尽心尽力', '尽心竭力', '尽快', '尽早', '尽然', '尽管', '尽管如此', '尽量', '局外', '居然', '届时', '属于', '屡', '屡屡', '屡次', '屡次三番', '岂', '岂但', '岂止', '岂非', '川流不息', '左右', '巨大', '巩固', '差一点', '差不多', '己', '已', '已矣', '已经', '巴', '巴巴', '带', '帮助', '常', '常常', '常言说', '常言说得好', '常言道', '平素', '年复一年', '并', '并不', '并不是', '并且', '并排', '并无', '并没', '并没有', '并肩', '并非', '广大', '广泛', '应当', '应用', '应该', '庶乎', '庶几', '开外', '开始', '开展', '引起', '弗', '弹指之间', '强烈', '强调', '归', '归根到底', '归根结底', '归齐', '当', '当下', '当中', '当儿', '当前', '当即', '当口儿', '当地', '当场', '当头', '当庭', '当时', '当然', '当真', '当着', '形成', '彻夜', '彻底', '彼', '彼时', '彼此', '往', '往往', '待', '待到', '很', '很多', '很少', '後来', '後面', '得', '得了', '得出', '得到', '得天独厚', '得起', '心里', '必', '必定', '必将', '必然', '必要', '必须', '快', '快要', '忽地', '忽然', '怎', '怎么', '怎么办', '怎么样', '怎奈', '怎样', '怎麽', '怕', '急匆匆', '怪', '怪不得', '总之', '总是', '总的来看', '总的来说', '总的说来', '总结', '总而言之', '恍然', '恐怕', '恰似', '恰好', '恰如', '恰巧', '恰恰', '恰恰相反', '恰逢', '您', '您们', '您是', '惟其', '惯常', '意思', '愤然', '愿意', '慢说', '成为', '成年', '成年累月', '成心', '我', '我们', '我是', '我的', '或', '或则', '或多或少', '或是', '或曰', '或者', '或许', '战斗', '截然', '截至', '所', '所以', '所在', '所幸', '所有', '所谓', '才', '才能', '扑通', '打', '打从', '打开天窗说亮话', '扩大', '把', '抑或', '抽冷子', '拦腰', '拿', '按', '按时', '按期', '按照', '按理', '按说', '挨个', '挨家挨户', '挨次', '挨着', '挨门挨户', '挨门逐户', '换句话说', '换言之', '据', '据实', '据悉', '据我所知', '据此', '据称', '据说', '掌握', '接下来', '接着', '接著', '接连不断', '放量', '故', '故意', '故此', '故而', '敞开儿', '敢', '敢于', '敢情', '数/', '整个', '断然', '方', '方便', '方才', '方能', '方面', '旁人', '无', '无宁', '无法', '无论', '既', '既...又', '既往', '既是', '既然', '日复一日', '日渐', '日益', '日臻', '日见', '时候', '昂然', '明显', '明确', '是', '是不是', '是以', '是否', '是的', '显然', '显著', '普通', '普遍', '暗中', '暗地里', '暗自', '更', '更为', '更加', '更进一步', '曾', '曾经', '替', '替代', '最', '最后', '最大', '最好', '最後', '最近', '最高', '有', '有些', '有关', '有利', '有力', '有及', '有所', '有效', '有时', '有点', '有的', '有的是', '有着', '有著', '望', '朝', '朝着', '末##末', '本', '本人', '本地', '本着', '本身', '权时', '来', '来不及', '来得及', '来看', '来着', '来自', '来讲', '来说', '极', '极为', '极了', '极其', '极力', '极大', '极度', '极端', '构成', '果然', '果真', '某', '某个', '某些', '某某', '根据', '根本', '格外', '梆', '概', '次第', '欢迎', '欤', '正值', '正在', '正如', '正巧', '正常', '正是', '此', '此中', '此后', '此地', '此处', '此外', '此时', '此次', '此间', '殆', '毋宁', '每', '每个', '每天', '每年', '每当', '每时每刻', '每每', '每逢', '比', '比及', '比如', '比如说', '比方', '比照', '比起', '比较', '毕竟', '毫不', '毫无', '毫无例外', '毫无保留地', '汝', '沙沙', '没', '没奈何', '没有', '沿', '沿着', '注意', '活', '深入', '清楚', '满', '满足', '漫说', '焉', '然', '然则', '然后', '然後', '然而', '照', '照着', '牢牢', '特别是', '特殊', '特点', '犹且', '犹自', '独', '独自', '猛然', '猛然间', '率尔', '率然', '现代', '现在', '理应', '理当', '理该', '瑟瑟', '甚且', '甚么', '甚或', '甚而', '甚至', '甚至于', '用', '用来', '甫', '甭', '由', '由于', '由是', '由此', '由此可见', '略', '略为', '略加', '略微', '白', '白白', '的', '的确', '的话', '皆可', '目前', '直到', '直接', '相似', '相信', '相反', '相同', '相对', '相对而言', '相应', '相当', '相等', '省得', '看', '看上去', '看出', '看到', '看来', '看样子', '看看', '看见', '看起来', '真是', '真正', '眨眼', '着', '着呢', '矣', '矣乎', '矣哉', '知道', '砰', '确定', '碰巧', '社会主义', '离', '种', '积极', '移动', '究竟', '穷年累月', '突出', '突然', '窃', '立', '立刻', '立即', '立地', '立时', '立马', '竟', '竟然', '竟而', '第', '第二', '等', '等到', '等等', '策略地', '简直', '简而言之', '简言之', '管', '类如', '粗', '精光', '紧接着', '累年', '累次', '纯', '纯粹', '纵', '纵令', '纵使', '纵然', '练习', '组成', '经', '经常', '经过', '结合', '结果', '给', '绝', '绝不', '绝对', '绝非', '绝顶', '继之', '继后', '继续', '继而', '维持', '综上所述', '缕缕', '罢了', '老', '老大', '老是', '老老实实', '考虑', '者', '而', '而且', '而况', '而又', '而后', '而外', '而已', '而是', '而言', '而论', '联系', '联袂', '背地里', '背靠背', '能', '能否', '能够', '腾', '自', '自个儿', '自从', '自各儿', '自后', '自家', '自己', '自打', '自身', '臭', '至', '至于', '至今', '至若', '致', '般的', '良好', '若', '若夫', '若是', '若果', '若非', '范围', '莫', '莫不', '莫不然', '莫如', '莫若', '莫非', '获得', '藉以', '虽', '虽则', '虽然', '虽说', '蛮', '行为', '行动', '表明', '表示', '被', '要', '要不', '要不是', '要不然', '要么', '要是', '要求', '见', '规定', '觉得', '譬喻', '譬如', '认为', '认真', '认识', '让', '许多', '论', '论说', '设使', '设或', '设若', '诚如', '诚然', '话说', '该', '该当', '说明', '说来', '说说', '请勿', '诸', '诸位', '诸如', '谁', '谁人', '谁料', '谁知', '谨', '豁然', '贼死', '赖以', '赶', '赶快', '赶早不赶晚', '起', '起先', '起初', '起头', '起来', '起见', '起首', '趁', '趁便', '趁势', '趁早', '趁机', '趁热', '趁着', '越是', '距', '跟', '路经', '转动', '转变', '转贴', '轰然', '较', '较为', '较之', '较比', '边', '达到', '达旦', '迄', '迅速', '过', '过于', '过去', '过来', '运用', '近', '近几年来', '近年来', '近来', '还', '还是', '还有', '还要', '这', '这一来', '这个', '这么', '这么些', '这么样', '这么点儿', '这些', '这会儿', '这儿', '这就是说', '这时', '这样', '这次', '这点', '这种', '这般', '这边', '这里', '这麽', '进入', '进去', '进来', '进步', '进而', '进行', '连', '连同', '连声', '连日', '连日来', '连袂', '连连', '迟早', '迫于', '适应', '适当', '适用', '逐步', '逐渐', '通常', '通过', '造成', '逢', '遇到', '遭到', '遵循', '遵照', '避免', '那', '那个', '那么', '那么些', '那么样', '那些', '那会儿', '那儿', '那时', '那末', '那样', '那般', '那边', '那里', '那麽', '部分', '都', '鄙人', '采取', '里面', '重大', '重新', '重要', '鉴于', '针对', '长期以来', '长此下去', '长线', '长话短说', '问题', '间或', '防止', '阿', '附近', '陈年', '限制', '陡然', '除', '除了', '除却', '除去', '除外', '除开', '除此', '除此之外', '除此以外', '除此而外', '除非', '随', '随后', '随时', '随着', '随著', '隔夜', '隔日', '难得', '难怪', '难说', '难道', '难道说', '集中', '零', '需要', '非但', '非常', '非徒', '非得', '非特', '非独', '靠', '顶多', '顷', '顷刻', '顷刻之间', '顷刻间', '顺', '顺着', '顿时', '颇', '风雨无阻', '饱', '首先', '马上', '高低', '高兴', '默然', '默默地', '齐', '︿', '！', '＃', '＄', '％', '＆', '＇', '（', '）', '）÷（１－', '）、', '＊', '＋', '＋ξ', '＋＋', '，', '，也', '－', '－β', '－－', '－［＊］－', '．', '／', '：', '；', '＜', '＜±', '＜Δ', '＜λ', '＜φ', '＜＜', '＝', '＝″', '＝☆', '＝（', '＝－', '＝［', '＝｛', '＞', '＞λ', '］', '］∧′＝［', '］［', '＿', 'ａ］', 'ｂ］', 'ｃ］', 'ｅ］', 'ｆ］', 'ｎｇ昉', '｛', '｛－', '｜', '｝', '｝＞', '～', '～±', '～＋', '￥']
    # print(len(stop_words)) # 1711
    # print(type(stop_words)) # <class 'list'>

stop_words = list(set(stop_words)) # 打乱顺序+去重
# print(stop_words) # ['', '真正', '千万', '由', '又', '这么样', '很多', '随后', '主张', '您是', '也就是说', '全都', '联系', '很少', '要是', '复杂', '白白', '随时', '数/', '每逢', '先后', '维持', '自打', '最好', '㈧', '乃', '个人', '先後', '据实', '上下', '其实', '八成', '全身心', '强烈', '仅', '对应', '待', '难道', '本', '成心', '挨家挨户', '相对', '不惟', '些', '使得', '彻夜', '自后', '＞λ', '赖以', '伟大', '见', '趁', '经过', '咳', '挨着', '一则', '呼啦', '宁肯', '何止', '只有', '今天', '略加', '且说', '依据', '纵', '如次', '共总', '诚然', '接连不断', '多次', '绝顶', '由是', '从古到今', '最大', '年复一年', '举凡', '既然', '背靠背', '凭', '牢牢', '非常', '吓', '的确', '鉴于', '可能', '通常', '继而', '得出', '甚至于', '偶尔', '按说', '乌乎', '不比', '独', '转变', '叫', '部分', '再次', '个别', '这个', '没有', '例如', '一何', '满', '人民', '她是', '从重', '具体', '会', '大张旗鼓', '及至', '假如', '俺', '！', '呗', '把', '到头来', 'ｎｇ昉', '至若', '犹且', '看来', '分期分批', '後面', '亲身', '要不是', '动辄', '它们', '对待', '漫说', '具有', '之前', '具体地说', '明显', '可好', '兮', '此外', '一片', '有时', '忽地', '每当', '显然', '欢迎', '以至', '达旦', '喽', '甫', '允许', '就', '决定', '类如', '毋宁', '相信', '＜Δ', '加强', '前后', '率尔', '各地', '还有', '常', '但愿', '今後', '怎么办', '得天独厚', '不是', '儿', '）、', '只当', '后', '不只', '而后', '大略', '愤然', '挨门挨户', '不了', '传说', '共同', '特点', '长期以来', '对', '连声', '来讲', '｛－', '必然', '常常', '他是', '但是', '照', '小', '每时每刻', '－－', '矣', '这儿', '大体', '可见', '哪怕', '而是', '甚而', '并不', '莫非', '获得', '尽心竭力', '无法', '到底', '里面', '必将', '背地里', '每个', '造成', '莫不然', '连连', '为什麽', '先不先', '倘或', '啊哈', '保持', '问题', '者', '弗', '遇到', '故', '孰料', '＋', '方才', '取得', '叮咚', '从头', '当下', '假使', '哪', '已经', '反之亦然', '下去', '靠', '再其次', '争取', '乘胜', '毫无例外', '经常', '开始', '虽说', '一个', '强调', '一起', '从严', '内', '怪不得', '］［', '整个', '此', '最後', '却', '逐步', '如若', '勃然', '几乎', '决不', '哗啦', '至', '保管', '结果', '不得不', '如何', '看', '出', '无', '来看', '哪里', '无论', '可是', '似乎', '据此', '以故', '不若', '有着', '以', '什麽', '那个', '.日', '此间', '正是', '恰好', '如上所述', '行为', '丰富', '某些', '并排', '因为', '不对', '齐', '简直', '岂', '倘使', '先生', '没', '(', '+', '恰恰相反', '则', '哪样', '呀', '不仅仅', '＜', '尽', '起首', '之一', '长此下去', '分期', '这种', '从此', '其一', '交口', '有效', '纵然', '或多或少', '二来', '如前所述', '若夫', '自从', '比', '望', '看上去', '以前', '组成', '凭借', '由此', '反之则', '喂', '归', '除此而外', '怎麽', '宣布', '达到', '一.', '（', '表明', '比起', '逐渐', '移动', '上', '大约', '为', 'ａ］', '沙沙', 'ｆ］', '次第', '路经', '咱', '并肩', '请勿', '云尔', '为了', '最后', '砰', '别', '代替', '一次', '周围', '尤其', '从来', '这里', '后者', '庶乎', '汝', '单纯', '容易', '避免', '实现', '毕竟', '挨次', '略', '略微', '顿时', '即若', '但凡', '自己', '那般', '策略地', '窃', '恰逢', '切莫', '难得', '云云', '全部', '一切', '安全', '应该', '赶快', '自', '大多数', '一来', '严格', '这般', '不管', '极了', '粗', '］', '就是说', '今年', '倍加', '应用', '归根到底', '"', '便', '来得及', '以期', '其余', '处理', '昂然', '朝着', '帮助', '加上', '有点', '用来', '前此', '任务', '坚持', '快要', '随', '呵呵', '本身', '总的来说', '看起来', '倘若', '乒', '奇', '据说', '为着', '种', '一些', '战斗', '彼', '知道', '那么', '碰巧', '哪年', '到目前为止', '冲', '｛', '到头', '正值', '不亦乐乎', '喔唷', '将要', '这麽', '嗳', '届时', '每年', '少数', '从事', '沿', '对于', '简言之', '集中', '替', '上去', '匆匆', '等等', '而已', '一时', '概', '据', '他', '不尽', '彻底', '较为', '似的', '将才', '不大', '某', '藉以', '将', '运用', '更加', '不消', '第', '各人', '真是', '恍然', '广泛', '元／吨', '那样', '不能', '莫若', '不单', '得了', '继之', '怎样', '介于', '光', '单', '适应', '哦', '咋', '并没有', '不限', '正常', '＜±', '当着', '截然', '哎', '一', '《', '不够', '不少', '个', '离', '恰如', '若果', '不变', '其二', '必须', '既...又', '只', '必要', '＜＜', '」', '更为', '共', '譬如', '一旦', '极为', '限制', '极', '积极', '合理', '适用', '哪天', '＄', '多多少少', '愿意', '咦', '要求', '而况', '▲', '固然', '替代', '；', '＝☆', '密切', '尽量', '不料', '比及', '此中', '人', '谁', '、', '不尽然', '以上', '不会', '看见', '不胜', '老是', '六', '进行', '另方面', '按时', '哇', '除非', '今', '任何', '目前', '腾', '如上', '十分', '乘隙', '从未', '累年', '唉', '相对而言', '假若', '别是', '过去', '该', '其后', '被', '从古至今', '自个儿', '去', '不仅', '哼唷', '本地', '巩固', '切', '不光', '￥', '三番五次', '让', '据悉', '啷当', '连', '各', '中间', '而言', '迅速', '屡', '大面儿上', '余外', '方面', '那会儿', '加以', '这', './', '充其量', '千万千万', '练习', '当然', '暗自', '开展', '且不说', '嗯', '『', '再者', '当场', '紧接着', '仍', '居然', '传闻', '挨个', '竟然', '既', '就算', '不可抗拒', '形成', '特别是', '谁知', '她的', '切切', '截至', '然则', '不可开交', '尽早', '哟', '上面', '尔后', '大多', '然後', '大大', '即是说', '倍感', '简而言之', '～', '有关', '极其', '也好', '反倒', '〕〔', '不怕', '为此', '嗡', '么', '另悉', '其次', '切勿', '其他', '全年', '存心', '在于', '哪些', '姑且', '是', '比如', '使用', '并无', '现代', '起先', '纯粹', '之所以', '彼时', '眨眼', '.数', '同时', '近来', '奋勇', '...', '从此以后', '根本', '臭', '均', '反倒是', '行动', '说来', '尽可能', '大体上', '比照', '给', '过于', '别管', '.一', '如下', '，', '总的说来', '关于', '逢', '高低', '这时', '仅仅', '当儿', '同样', '何以', '大', ')', '毫无', '当中', '成年', '尔等', '刚', '遭到', '＝－', '这点', '趁早', '他人', '下', '清楚', '权时', '不外乎', '诸位', '喀', '所谓', '有利', '尽管', '格外', '心里', '今后', '不迭', '日益', '多年前', '几', '带', '暗地里', '借此', '七', '即刻', '＋ξ', '设或', '前进', '成为', '接下来', '话说', '每', '什么样', '为何', '嘛', '任凭', '莫不', '屡次三番', '默然', '随着', '正巧', '人家', '一面', '呕', '第二', '规定', '只要', '有及', '论', '．', '大家', '至于', '不巧', '确定', '迟早', '这一来', '认为', '一下', '三番两次', '诸如', 'ｂ］', '直接', '较比', '具体说来', '社会主义', '呃', '吱', '其中', '彼此', '分别', '看看', '因了', '那么些', '～±', '现在', '不独', '之类', '鄙人', '全然', '各种', '时候', '宁愿', '普遍', '不', '梆', '千', '认识', '哪个', '大凡', '如是', '很', '与否', '也', '凡是', '老', '活', '针对', '以便', '重要', '巴', '切不可', '有的', '这么点儿', '别的', '双方', '平素', '理当', '完成', '傥然', '常言道', '罢了', '即', '陈年', '啥', '总结', '不特', '乘虚', '／', '出现', '能', '大致', '非但', '产生', '以外', '就是', '地', '继续', '一方面', '伙同', '进步', '还', '一边', '如', '刚好', '老大', '单单', '你的', '得起', '大力', '串行', '■', '乎', '日臻', '是不是', '就此', '既是', '遵循', '且', '其', '迫于', '长线', '动不动', '总而言之', '。', '然而', '也是', '较之', '!', '恰恰', '完全', '以来', '两者', '受到', '通过', '各级', '毫无保留地', '不但', '瑟瑟', '不外', '当口儿', '除却', '相反', '︿', '》', '极力', '方', '已', '但', '不起', '诚如', '做到', '具体来说', '另一个', '也罢', '而且', '一般', '一番', '表示', '果然', '以至于', '近年来', '从而', 'ｅ］', '决非', '设若', '其它', '之後', '我们', '竟而', '再说', '好', '注意', '与其', '不敢', '定', '有力', '了', '几度', '屡次', '本人', '吗', '更', '...................', '可以', '日见', '相当', '绝', '该当', '过', '最', '她们', '弹指之间', '有', '人人', '以及', '奈', '主要', '我的', '呜呼', '她', '引起', '起', '不力', '您', '不妨', '嘿', '根据', '不曾', '殆', '怎么', '亲自', '多多益善', '自身', '独自', '几番', '或者', '难说', '乃至', '它是', '从不', '这就是说', '亲口', '随著', '下列', '甚么', '人们', '临', '在', '朝', '常言说得好', '重新', '｝', '附近', '一直', '进来', '多数', '下面', '急匆匆', '只怕', '老老实实', '按', '趁势', '没奈何', '＝', '以致', '谁人', '巨大', '不能不', '防止', '乘', '或则', '因而', '及时', '如此', '这样', '据我所知', '当时', '经', '上升', '呆呆地', '再', '除此', '啊', '有的是', '你们', '大举', '吧', '惯常', '理应', '总的来看', '说说', '待到', '同', '正如', '全面', '或曰', '本着', '反应', '＞', '这边', '％', '换句话说', '此时', '即将', '哪儿', '再有', '敢情', '另一方面', '岂但', '一天', '不一', '欤', '）÷（１－', '不知不觉', '是以', '那时', '进去', '立', '得', '按理', '从中', '好象', '既往', '这次', '绝非', '来自', '不得了', '曾经', '咱们', "'", '取道', '嘘', '挨门逐户', '这会儿', '尽心尽力', '-', '用', '忽然', '并不是', '好的', '尚且', '要不然', '却不', '更进一步', '准备', '叫做', '纵令', '连同', '你', '此处', '不然的话', '还要', '仍然', '不断', '何须', '默默地', '何妨', '或', '白', '非特', '立刻', '重大', '穷年累月', '着', '为止', '就地', '虽', '曾', '此次', '--', '出来', '由于', '竟', '：', '不仅...而且', '他的', '总是', '所在', '近', '呐', '并且', '一样', '顷刻间', '从今以后', '虽则', '二', '不择手段', ',', '说明', '就是了', '打开天窗说亮话', '兼之', '突出', '分头', '日复一日', '如常', 'ｃ］', '嘻', '总之', '接著', '怕', '贼死', '叮当', '论说', '顷', '莫如', '那边', '差不多', '）', '若非', '结合', '促进', '而论', '如今', '无宁', '〔', '与', '零', '转贴', '遵照', '当', '刚巧', '略为', '照着', '原来', '高兴', '你是', '究竟', '管', '甚或', '它', '范围', '毫不', '..', '大概', '尽快', '普通', '亲手', '显著', '到', '轰然', '不成', '不足', '以后', '咚', '【', '而', '尔', '某某', '不管怎样', '陡然', '＿', '严重', '四', '有所', '矣乎', '莫', '非徒', '拿', '不至于', '不经意', '任', '不定', '相应', '明确', '嘿嘿', '一则通过', '适当', '哎哟', '传', '及', '临到', '等', '迄', '又及', '嗬', '$', '哈哈', '失去', '或是', '故此', '出于', '甚且', '趁机', '倒不如说', '倒不如', '哪边', '反之', '嘎登', '自家', '各位', '下来', '多', '隔夜', '构成', '不得', '除此之外', '来着', '良好', '从小', '啪达', '顶多', '从无到有', '出去', '大抵', '越是', '局外', '......', '呸', '比较', '何尝', '不止一次', '何处', '风雨无阻', '必', '立地', '纯', '大量', '只限', '不拘', '转动', '几时', '尽如人意', '乘势', '不必', '凑巧', '比方', '凝神', '意思', '三', '俺们', '同一', '纵使', '不下', '接着', '阿', '一致', '全力', '恰似', '不久', '多么', '固', '差一点', '敢于', '许多', '－β', '考虑', '况且', '若是', '%', '皆可', '将近', '借', '反过来说', '赶早不赶晚', '万一', '您们', '从优', '〈', '般的', '不问', '与其说', '来不及', '己', '还是', '除此以外', '有些', '每每', '要不', '连日', '除外', '有著', '相同', '所有', '怪', '呵', '设使', '－［＊］－', '实际', '按期', '与此同时', '趁便', '即如', '.', '甭', '从宽', '首先', '于', '哈', '掌握', '综上所述', '相等', '历', '不过', '绝不', '方能', '能够', '上来', '前面', '只是', '多亏', '三天两头', '广大', '往', '前者', '起头', '一一', '可', '＜φ', '此地', '或许', '才能', '当头', '看样子', '猛然', '如果', '即令', '如同', '尔尔', '不可', '换言之', '啊哟', '＇', '什么', '开外', '便于', '至今', '不怎么', '坚决', '当真', '作为', '&', '饱', '巴巴', '吧哒', '不已', '已矣', '沿着', '由此可见', '#', '打从', '他们', '多年来', '一转眼', '必定', '是的', '打', '啊呀', '譬喻', '并非', '长话短说', '就要', '怎奈', '间或', '不止', '依靠', '之', '归根结底', '日渐', '再者说', '于是乎', '最近', '那么样', '充分', '敢', '立时', '所幸', '以後', '仍旧', '颇', '何乐而不为', '怎么样', '不要', '别说', '啐', '赶', '处在', '起初', '那麽', '归齐', '因着', '起来', '除去', '向着', '从', '对方', '暗中', '反映', '率然', '断然', '除了', '能否', '嗡嗡', '旁人', '只消', '反过来', '不满', '何', '需要', '以免', '看到', '＃', '啦', '拦腰', '怎', '使', '然', '自各儿', '扑通', '矣哉', '再则', '比如说', '几经', '互相', '呜', '因', '》），', '继后', '从速', '末##末', '特殊', '在下', '的话', '别人', '左右', '跟', '五', '不论', '甚至', '进而', '半', '偏偏', '何必', '并没', '对比', '何苦', '亦', '即使', '非独', '要', '即或', '另行', '惟其', '大不了', '互', '宁', '是否', '应当', '之后', '岂非', '着呢', '二话不说', '加之', '向使', '好在', '满足', '连日来', '除', '八', '喏', '各式', '诸', '借以', '过来', '所以', '倘', '一定', '庶几', '趁热', '始而', '哩', '果真', '抑或', '不如', '不仅仅是', '何况', '否则', '采取', '它们的', '光是', '放量', '＋＋', '大事', '致', '九', '慢说', '而又', '到处', '那末', '＝｛', '缕缕', '＝（', '另', '恐怕', '哼', '上述', '尽管如此', '何时', '各自', '豁然', '大批', '直到', '多少', '这些', '公然', '精光', '和', '顷刻之间', '起见', '深入', '快', '不再', '常言说', '如此等等', '基本上', '进入', '呢', '难道说', '哎呀', '嘎嘎', '恰巧', '乃至于', '刚才', '从早到晚', '据称', '猛然间', '犹自', '除开', '不时', '另外', '等到', '不常', '举行', '古来', '＝″', '我', '故而', '正在', '非得', '联袂', '敞开儿', '所', '＆', '要么', '大都', '岂止', '那里', '不然', '从轻', '召开', '宁可', '极端', '当前', '－', '因此', '认真', '省得', '突然', '后来', '〕', '保险', '最高', '以为', '当地', '焉', '每天', '像', '呼哧', '隔日', '冒', '存在', '＜λ', '及其', '初', '成年累月', '都', '川流不息', '极度', '当庭', '孰知', '故意', '理该', '屡屡', '从新', '反而', '不由得', '亲眼', '』', '蛮', '那', '～＋', '若', '边', '为什么', '谨', '哉', '〉', '以下', '相似', '够瞧的', '依', '按照', '近几年来', '唯有', '才', '来', '而外', '嘎', '多多', '为主', '看出', '得到', '它的', '们', '处处', '谁料', '扩大', '别处', '距', '不免', '如期', '｜', '乘机', '方便', '专门', '反手', '全体', '立即', '如其', '我是', '然后', '］∧′＝［', '，也', '某个', '这么些', '了解', '于是', '後来', '属于', '二话没说', '抽冷子', '咧', '偶而', '觉得', '顷刻', '连袂', '难怪', '充其极', '此后', '当即', '加入', '基本', '凡', '倒是', '】', '＊', '不日', '依照', '马上', '倘然', '顺着', '企图', '来说', '则甚', '基于', '各个', '中小', '的', '较', '即便', '不得已', '顺', '｝＞', '立马', '那些', '＝［', '不同', '往往', '虽然', '变成', '这么', '后面', '哗', '极大', '不但...而且', '那儿', '向', '到了儿', '*', '尽然', '累次', '并', '绝对', '趁着']
# print(len(stop_words)) # 1711
import jieba
# lcut可以把一句话拆成一个个有意义的“词”，并返回一个列表（list）
# 输入jieba.lcut("我爱自然语言处理")
# 输出['我', '爱', '自然语言', '处理']
word_list=[','.join(jieba.lcut(line)) for line in data['内容']] # 注意这里是line（data的一部分）不是lines（stop_words列表化）
# 等价于：
# word_list = []
# for line in data['内容']:
#     words = jieba.lcut(line)      # 对每一行文本进行分词
#     joined = ','.join(words)      # 用逗号拼接成一个字符串
#     word_list.append(joined)


# print(len(word_list))
# print(word_list)

# 词频统计
# 这段代码是情感分析或文本分类中“文本向量化”的关键步骤之一
from sklearn.feature_extraction.text import CountVectorizer
transform=CountVectorizer(stop_words=stop_words)
# CountVectorizer() 的作用： 创建一个“文本转数字”的工具。
# stop_words=stop_words 表示在向量化时忽略停用词（如“的”“是”“了”等无意义词）。
x=transform.fit_transform(word_list)
# fit_transform() 由两部分组成：
# fit()	学习所有文本中有哪些不同的词（构建词汇表 vocabulary）
# transform()	根据这个词汇表，把每条文本转换为数字向量
# 举例：
# 假设 word_list 是：
# ["这 本 书 很 好", "这 本 书 很 差"]
# 去掉停用词后，只剩：
# ["书 好", "书 差"]
# CountVectorizer 学习后发现总共有 3 个词：
# ["书", "好", "差"]
# 于是生成一个矩阵：
# 文本	    书	好	差
# 这本书很好	1	1	0
# 这本书很差	1	0	1

# print(x)
# <Compressed Sparse Row sparse matrix of dtype 'int64'
# 	with 50 stored elements and shape (13, 37)>
#   Coords	Values
#   (0, 29)	1
#   (0, 13)	1
#   (0, 31)	1
#   (0, 5)	1
#   (0, 19)	1
#   (1, 13)	1
#   (1, 5)	1
#   (1, 26)	1
#   (1, 34)	1
#   (2, 32)	1
#   (2, 27)	1
#   (2, 36)	1
#   (2, 2)	1
#   (2, 35)	1
#   (2, 9)	1
#   (3, 8)	1
#   (3, 7)	1
#   (3, 20)	1
#   (3, 22)	1
#   (3, 30)	1
#   (3, 16)	1
#   (4, 20)	1
#   (4, 1)	1
#   (4, 18)	1
#   (5, 3)	1
#   (5, 17)	1
#   (5, 10)	1
#   (5, 4)	1
#   (5, 23)	1
#   (6, 29)	1
#   (6, 34)	1
#   (6, 10)	1
#   (6, 6)	1
#   (6, 21)	1
#   (6, 33)	1
#   (7, 25)	1
#   (7, 0)	1
#   (8, 34)	1
#   (8, 33)	1
#   (8, 12)	1
#   (8, 14)	1
#   (8, 28)	1
#   (9, 11)	1
#   (10, 10)	1
#   (11, 29)	1
#   (11, 13)	1
#   (11, 34)	1
#   (11, 28)	1
#   (12, 24)	2
#   (12, 15)	1
names = transform.get_feature_names_out()
# print(names) # ['一本' '一遍' '三个' '中规中矩' '依旧' '入门' '内容' '分讲' '前半部' '受益匪浅' '基础' '基础知识' '完完全全' '小白' '小白读' '建议' '很赞' '教科书' '有个' '极佳' '概念' '浅显' '深入浅出' '看不懂' '真的' '破书' '简洁' '细节' '经验' '编程' '要言不烦' '角度看' '讲解' '语言' '适合' '项目' '顾及']
# get_feature_names_out()
# 返回 CountVectorizer 生成的所有特征词（即列名）：
# # ['书' '好' '差']
# 这在后续做特征分析时非常有用，比如看模型最关注哪些词。
x=x.toarray()
# 把稀疏矩阵转成普通数组
# 🔹 fit_transform() 返回的是 稀疏矩阵（sparse matrix）。
# 原因是：大多数文本不会包含所有词，为了节省内存，只存储非零部分。
# 🔹 x.toarray() 把它转换成 普通的二维 numpy 数组，方便后续查看或输入模型。

# print(x)
# 从边集合变成了邻接矩阵
# [[0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0
#   0]
#  [0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0
#   0]
#  [0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1 0 0 1
#   1]
#  [0 0 0 0 0 0 0 1 1 0 0 0 0 0 0 0 1 0 0 0 1 0 1 0 0 0 0 0 0 0 1 0 0 0 0 0
#   0]
#  [0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
#   0]
#  [0 0 0 1 1 0 0 0 0 0 1 0 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0
#   0]
#  [0 0 0 0 0 0 1 0 0 0 1 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 0 1 1 0
#   0]
#  [1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0
#   0]
#  [0 0 0 0 0 0 0 0 0 0 0 0 1 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 1 1 0
#   0]
#  [0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
#   0]
#  [0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
#   0]
#  [0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 0 0 0 0 1 0
#   0]
#  [0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 2 0 0 0 0 0 0 0 0 0 0 0
#   0]]
# print(len(x)) # 13
# print(len(x[0])) # 37

# 划分测试集数据集
x_train=x[:10,:]
# print(len(x_train)) # 10
# print(y)
# 0     1
# 1     1
# 2     1
# 3     1
# 4     0
# 5     0
# 6     0
# 7     0
# 8     0
# 9     1
# 10    0
# 11    0
# 12    0
# Name: labels, dtype: int64
# print(type(y)) # <class 'pandas.core.series.Series'>
y_train=y.values[0:10]
# print(y_train) # [1 1 1 1 0 0 0 0 0 1]
# print(type(y)) # <class 'pandas.core.series.Series'>
x_test=x[10:,:]
y_test=y.values[10:]
# print(x_train.shape) # (10, 37)
# print(y_train.shape) # (10,)

# 模型训练
from sklearn.naive_bayes import MultinomialNB
# MultinomialNB 是 sklearn 里的一种 朴素贝叶斯分类器。
# 适用于 离散特征数据，比如词频、文本中某个词出现的次数（就是我们之前 CountVectorizer 生成的矩阵）。
# 这也是为什么文本分类常用它，因为文本特征本质上是词出现次数。
model =MultinomialNB(alpha=1)
# alpha=1 是 拉普拉斯平滑（Laplace smoothing） 参数。
# 为什么需要平滑？
# 有些词在训练集里没有出现过，但在测试集里出现了。如果不平滑，概率就会变成 0，模型会崩掉。
# alpha=1 表示给每个词加 1 的计数，避免概率为 0。
model.fit(x_train,y_train)
# fit() 的作用：
# 学习每个词在好评和差评中出现的概率
# 计算先验概率 𝑃(好评)和 𝑃(差评)
# 为预测做好准备
y_predict=model.predict(x_test)
# x_test：测试集特征矩阵
# predict() 会输出预测标签（1好评 或 0差评）
print(y_predict)
print("%.3f" % model.score(x_test,y_test)) # 1.000表示预测完全正确

# ==========================================================================================
'''

'''
# 2.特征降维----低方差过滤法
import pandas as pd
data=pd.read_csv("垃圾邮件分类数据.csv")
# print(data.shape) #(971, 25734)
from sklearn.feature_selection import VarianceThreshold
transform=VarianceThreshold(threshold=0.1)
x=transform.fit_transform(data)
# print(x.shape) #(971, 1044) 降维到原来的20分之1
# ======================================================
'''

'''
# 3.主成分分析
from sklearn.datasets import load_iris
x,y=load_iris(return_X_y=True)# 导入鸢尾花数据集
# print(x)
# print(x.shape) # (150, 4)
from sklearn.decomposition import PCA
# Principal component analysis
pca1=PCA(n_components=0.95) # 这句什么意思?
x1=pca1.fit_transform(x)
# print(x1)
# print(x1.shape) # (150, 2)
pca1=PCA(n_components=3) # 保留三个特征
x2=pca1.fit_transform(x)
# print(x2)
# print(x2.shape) # (150, 3)
# ======================================================
'''

'''
# 4.计算相关系数
from sklearn.datasets import load_iris
x,y=load_iris(return_X_y=True)
x1=x[:,2] # 选取第3列
x2=x[:,1] # 选取第2列
# print(x1.shape) # (150,)
# print(x2.shape) # (150,)
from scipy.stats import pearsonr,spearmanr
corr=pearsonr(x1,x2)
print('皮尔逊相关系数：',corr[0],'这两个特征的不相关性概率',corr[1])
corr=spearmanr(x1,x2)
print('斯皮尔曼相关系数：',corr[0],'这两个特征的不相关性概率',corr[1])
'''